HELYXcore-4.4.0/examples/legacy/compressible/rhoPimpleFoam/RAS/TJunction/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            uniformTotalPressure;
        gamma           1.2;

        p0              table
        (
            (0 1e5)
            (1 1.4e5)
        );
    }

    outlet1
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet2
    {
        type            fixedValue;
        value           $internalField;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
