HELYXcore-4.4.0/examples/legacy/compressible/rhoPimpleFoam/RAS/TJunction/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01;       // 1cm - half channel height
        value           $internalField;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    outlet2
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    defaultFaces
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
